update high level diagram
